package com.javarush.test.level08.lesson11.home03;

import java.util.HashMap;
import java.util.Map;

/* Люди с одинаковыми именами и/или фамилиями
1. Создать словарь Map (<String, String>) и добавить туда 10 человек в виде «Фамилия»-«Имя».
2. Пусть среди этих 10 человек есть люди с одинаковыми именами.
3. Пусть среди этих 10 человек есть люди с одинаковыми фамилиями.
4. Вывести содержимое Map на экран.
*/

public class Solution
{
    public static void main(String[] args)
    {
        Map<String, String> map = createPeopleList();
        printPeopleList(map);
    }

    public static Map<String, String> createPeopleList()
    {
        //напишите тут ваш код
        Map<String, String> map = new HashMap<String, String>();
        map.put("Sidorov", "Ivan");
        map.put("Sidorov", "Ivan1");
        map.put("Sidorov1", "Ivan2");
        map.put("Sidorov2", "Ivan3");
        map.put("Sidorov3", "Ivan4");
        map.put("Sidorov4", "Ivan5");
        map.put("Sidorov5", "Ivan6");
        map.put("Sidorov6", "Ivan7");
        map.put("Sidorov7", "Ivan8");
        map.put("Sidorov8", "Ivan");

        return map;
    }

    public static void printPeopleList(Map<String, String> map)
    {
        for (Map.Entry<String, String> s : map.entrySet())
        {
            System.out.println(s.getKey() + " " + s.getValue());
        }
    }

}
